In [124]:
import pandas as pd
%matplotlib inline
train=pd.read_csv('Workshop/Testtoday.csv')
train1=pd.read_csv('Workshop/train.csv')

In [125]:
train.head()

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
LP001002,Male,No,0,Graduate,1408039037,NaN,360,1,Braund,Mr. Owen Harris,Y
LP001003,Male,Yes,1,Graduate,1408038611,128,360,NaN,Rural,N,NaN
LP001005,NaN,NaN,NaN,NaN,NaN,NaN,360,1,Urban,Y,NaN
LP001006,Male,Yes,0,Not Graduate,1408038568,120,360,1,Allen,Mr. William Henry,Y
LP001008,Male,No,0,Graduate,1408039177,141,360,NaN,Urban,Y,NaN

In [11]:
temp = train.dropna(axis=0, how='any', thresh=train.shape[1] - 5)

In [12]:
temp.head()

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,5849,NaN,360,1,Urban,Y
1,LP001003,Male,Yes,1,Graduate,4583,128,360,NaN,Rural,N
3,LP001006,Male,Yes,0,Not Graduate,2583,120,360,1,Urban,Y
4,LP001008,Male,No,0,Graduate,6000,141,360,NaN,Urban,Y

In [18]:
turn_dict = {'Urban': 'City', 'Semiurban': 'City', 'Rural': 'Village'}

In [19]:
train.loc[:, 'Property_Area'] = train.Property_Area.replace(turn_dict)

In [20]:
train.head()

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,5849,NaN,360,1,City,Y
1,LP001003,Male,Yes,1,Graduate,4583,128,360,NaN,Village,N
2,LP001005,NaN,NaN,NaN,NaN,NaN,NaN,360,1,City,Y
3,LP001006,Male,Yes,0,Not Graduate,2583,120,360,1,City,Y
4,LP001008,Male,No,0,Graduate,6000,141,360,NaN,City,Y

In [26]:
(train.loc[(train.Gender == 'Male') & (train.Married == 'Yes')].shape[1] / float(train.shape[0]))*100

220.00000000000003

In [27]:
test=pd.read_csv('Workshop/test.csv')

In [28]:
set(test.columns).difference(set(train.columns))

{'Age',
 'Hours.Per.Week',
 'ID',
 'Marital.Status',
 'Native.Country',
 'Occupation',
 'Race',
 'Relationship',
 'Sex',
 'Workclass'}

In [29]:
set(test.columns.tolist()) - set(train.columns.tolist())

{'Age',
 'Hours.Per.Week',
 'ID',
 'Marital.Status',
 'Native.Country',
 'Occupation',
 'Race',
 'Relationship',
 'Sex',
 'Workclass'}

In [40]:
set(test.Age.unique()).issubset(set(train1.Age.unique()))

False

In [42]:
# binning hors per week and creating age bands
bins = [1,5,10,15,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,95,100]
train1['Hours_categories'] = pd.cut(train1['Hours.Per.Week'], bins)
test['Hours_categories'] = pd.cut(test['Hours.Per.Week'], bins)
train1.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group,Hours_categories
0,1,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K,"(35, 40]"
1,2,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K,"(10, 15]"
2,3,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K,"(35, 40]"
3,4,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K,"(35, 40]"
4,5,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K,"(35, 40]"

In [49]:
train['Property_Area'].str.split(' ').str[-1]

0      21171
1      Rural
2      Urban
3    3101282
4      Urban
dtype: object

In [56]:
train['LoanAmount'] = train.groupby('Gender').transform(lambda x: x.fillna(x.mean())).LoanAmount

In [61]:
train.loc[(train.Loan_Status == 'Y') & (train.Gender == 'Male')].shape[0]

3

In [62]:
train.head()

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,5849,129.666667,360,1,A/5 21171,Y
1,LP001003,Male,Yes,1,Graduate,4583,128.000000,360,NaN,Rural,N
2,LP001005,NaN,NaN,NaN,NaN,NaN,NaN,360,1,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,2583,120.000000,360,1,STON/O2. 3101282,Y
4,LP001008,Male,No,0,Graduate,6000,141.000000,360,NaN,Urban,Y

In [66]:
(train['Property_Area'].str.find('Mr.')>0).sum()

2

In [73]:
train['Missing_Education'] = train.Education.isnull().astype(int)

In [74]:
train.head()

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Missing_Education
LP001002,Male,No,0,Graduate,5849,NaN,360,1,Braund,Mr. Owen Harris,Y,0
LP001003,Male,Yes,1,Graduate,4583,128,360,NaN,Rural,N,NaN,0
LP001005,NaN,NaN,NaN,NaN,NaN,NaN,360,1,Urban,Y,NaN,1
LP001006,Male,Yes,0,Not Graduate,2583,120,360,1,Allen,Mr. William Henry,Y,0
LP001008,Male,No,0,Graduate,6000,141,360,NaN,Urban,Y,NaN,0

In [81]:
train['Dependents'] = train['Dependents'].astype('category')

In [82]:
train.dtypes

Loan_ID                object
Gender                 object
Married               float64
Dependents           category
Education             float64
ApplicantIncome       float64
LoanAmount              int64
Loan_Amount_Term      float64
Credit_History         object
Property_Area          object
Loan_Status            object
Missing_Education       int64
dtype: object

In [91]:
train.Gender.str.startswith('M')

LP001002    False
LP001003    False
LP001005      NaN
LP001006    False
LP001008    False
Name: Gender, dtype: object

In [100]:
train1.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [108]:
train1['Relationship_Percentage'] = train1.Relationship.map(train1.Relationship.value_counts()/train1.shape[0])

In [109]:
train1.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group,Relationship_Percentage
0,1,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K,0.255060
1,2,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K,0.405178
2,3,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K,0.255060
3,4,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K,0.405178
4,5,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K,0.048156

In [130]:
train['Date_time']=pd.to_datetime(train['Education'],unit='s')

In [133]:
pd.datetime.now() - train.Date_time

LP001002   772 days 17:56:03.026430
LP001003   772 days 18:03:09.026430
LP001005                        NaT
LP001006   772 days 18:03:52.026430
LP001008   772 days 17:53:43.026430
Name: Date_time, dtype: timedelta64[ns]

In [136]:
string = "his email address is mailto:tom_42@gmail.com please mail him the documents"

In [137]:
import re

In [140]:
match=re.findall(r"[\w._]+@[\w.]+",string)

In [141]:
print match

['tom_42@gmail.com']

In [149]:
train1.groupby(['Income.Group','Sex']).size().loc['<=50K']

Sex
Female     9592
Male      15128
dtype: int64

In [147]:
train1['Sex'].value_counts()

Male      21790
Female    10771
dtype: int64